<template>
    <div>
        <Title :title="title" />
        <div id="need-help-category-root" class="container mt-5 mb-5">
            <div id="text" v-html="text"></div>
        </div>
    </div>
</template>

<script>

import Title from '@/components/Title.vue'

export default {
    components:{
        Title
    },
    data() {
        return {
            title: '',
            text: '',
            images: [] //скорее всего по url
        }
    },
    mounted(){
        //получение данных по API
        this.title = "Социальные службы, телефоны доверия,  горячие линии"
        this.text = `<p><em>Горячие линии<br>
                    Горячая линия - телефон доверия городского головы&nbsp;</em><br>
                    15-35<br>
                    (048) 705-55-55<br>
                    <em>Бесплатная национальная «Горячая линия» по вопросам насилия в семье и защиты прав детей</em><br>
                    0-800-500-335, для операторов мобильной связи (МТС, Лайф, Киевстар) - 386.&nbsp;<br>
                    <em>Бесплатная национальная детская «Горячая линия»</em><br>
                    0-800-500-225<br>
                    <em>Телефон доверия для подростков Одесского городского центра социальных служб для молодежи</em><br>
                    (048) 725-52-55 (9.00 – 18.00 автоответчик)<br>
                    <em>Одесская городская служба оперативного реагирования на чрезвычайные ситуации</em><br>
                    "077" - 15-77</p>`
    }
}
</script>